08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishFlow2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       8788;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          136;
        startFace       8852;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          136;
        startFace       8988;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8960;
        startFace       9124;
    }
    inlet
    {
        type            patch;
        nFaces          4;
        startFace       18084;
    }
    outlet
    {
        type            patch;
        nFaces          4;
        startFace       18088;
    }
)

// ************************************************************************* //
