08_RTD_openFoam/OpenFoamV2306/tundishBasic2D/tundishFlow2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.05;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         3;
    nOuterCorrectors    2;
/*
    residualControl
    {
        U
        {
                tolerance  1e-6;
                relTol      0;
        }
        p
        {
                tolerance  1e-3;
                relTol      0;
        }
     }
*/
}


relaxationFactors
{
    fields
    {
        p           1;
        pFinal      1;      // Last outer loop
    }
    equations
    {
        "U|k|epsilon"           1;
        "(U|k|epsilon)Final"    1;
    }
}
// ************************************************************************* //
